test/apiResponses/create-order/hapi-orderDiscount.json

{
  "completedOrder": {
    "orderId": 9658957,
    "subTotal": "42.00",
    "returnPossible": false,
    "returnRequested": false,
    "deliveryMethod": "UK Standard up to 5 days",
    "deliveryDate": "Tuesday 20 August 2019",
    "deliveryCost": "3.95",
    "deliveryCarrier": "Standard",
    "deliveryPrice": "3.95",
    "totalOrderPrice": "45.53",
    "totalOrdersDiscountLabel": "Monty Test 1% off",
    "totalOrdersDiscount": "-0.42",
    "discounts": [
      {
        "label": "Monty Test 1% off",
        "value": "0.42"
      }
    ],
    "billingAddress": {
      "address1": "1 Prideaux Place",
      "name": "Mr Test1 Test111",
      "country": "United Kingdom",
      "address2": "LONDON",
      "address3": "WC1X 9PR"
    },
    "deliveryAddress": {
      "address1": "1 Prideaux Place",
      "name": "Mr Test1 Test111",
      "country": "United Kingdom",
      "address2": "LONDON",
      "address3": "WC1X 9PR"
    },
    "orderLines": [
      {
        "lineNo": "02G26NMDT",
        "skuId": "31786881",
        "productId": "31787310",
        "name": "MOTO Mid Blue Step Hem Straight Jeans",
        "size": "W2630",
        "colour": "MID STONE",
        "imageUrl": "https://images.topshop.com/i/TopShop/TS02G26NMDT_M_1.jpg?$Small$",
        "quantity": 1,
        "unitPrice": "42.00",
        "discount": "",
        "discountPrice": "0.00",
        "total": "42.00",
        "nonRefundable": false,
        "baseImageUrl": "https://images.topshop.com/i/TopShop/TS02G26NMDT_M_1",
        "isDDPProduct": false,
        "ecmcCategory": "GIRL",
        "department": "2",
        "reviewRating": "",
        "category": "Jeans",
        "brand": "Topshop",
        "wasPrice": ""
      }
    ],
    "productRevenue": "42.00",
    "paymentDetails": [
      {
        "paymentMethod": "Visa",
        "cardNumberStar": "************1111",
        "totalCost": "£45.53",
        "totalCostAfterDiscount": "£45.53",
        "selectedPaymentMethod": "VISA"
      }
    ],
    "currencyConversion": {
      "currencyRate": "GBP"
    },
    "returning_buyer": false,
    "promoCodes": [
      {
        "promotionCode": "F84MB92NV9",
        "label": "Monty Test 1% off"
      }
    ],
    "userId": "5173099",
    "isDDPOrder": false,
    "ddpPromotion": {},
    "guestUserEmail": "",
    "userType": ""
  }
}
