test/apiResponses/create-order/wcs-orderDiscount.json

{
  "confirmationTitle": "Order Confirmation",
  "strstoreid": "12556",
  "strlangid": "-1",
  "thankYouTitle": "Thank you",
  "progressBarVar": "%0A%0A%3Col+id%3D%22checkout_progress%22+class%3D%22menu_inline+cf%22%3E%0A%09%0A%09%09%09%3Cli+class%3D%22step_login+%22%3E%3Cspan%3ESign+In%3C%2Fspan%3E%3C%2Fli%3E%0A%09%09%0A%09%09%09%09%09%3Cli+class%3D%22step_del+%22%3E%3Cspan%3EDelivery%3C%2Fspan%3E%3C%2Fli%3E%0A%09%09%09%09%0A%09%09%09%09%09%3Cli+class%3D%22step_pay+%22%3E%3Cspan%3EPayment%3C%2Fspan%3E%3C%2Fli%3E%0A%09%09%09%09%0A%09%09+++++%09%09%3Cli+class%3D%22step_thank+step_thank_active%22%3E%3Cspan+class%3D%22active%22%3EThank+You%3C%2Fspan%3E%3C%2Fli%3E%0A%09%09%09%09%0A%3C%2Fol%3E%0A",
  "thankYouMsg": "Thank you for your order",
  "OrderConfirmation": {
    "orderId": 9658957,
    "currencyCode": "GBP",
    "isDDPOrder": false,
    "orderItems": [
      {
        "orderItemId": "11125197",
        "selectedShipCode": "S",
        "deliveryCarrier": "Standard",
        "selectedDeliveryMethod": "UK Standard up to 5 days",
        "description1": "Up to 5 days",
        "description2": ""
      }
    ],
    "deliveryMethod": "UK Standard up to 5 days",
    "smsMobileNumber": "0987654321",
    "deliveryDetails": {
      "nameAndPhone": {
        "title": "Mr",
        "firstName": "Test1",
        "lastName": "Test111",
        "telephone": "0987654321"
      },
      "AddressDetails": {
        "city": "LONDON",
        "country": "United Kingdom",
        "address1": "1 Prideaux Place",
        "zipCode": "WC1X 9PR",
        "addressDetailsId": "4786570",
        "shippingDescription": "UK Standard up to 5 days",
        "estimatedDelivery": "No later thanTuesday 20 August 2019"
      }
    },
    "billingDetails": {
      "title": "Mr",
      "lastName": "Test111",
      "firstName": "Test1",
      "city": "LONDON",
      "country": "United Kingdom",
      "address1": "1 Prideaux Place",
      "address2": "",
      "zipCode": "WC1X 9PR"
    },
    "creditCardList": "AMEX,VISA,MCARD,ACCNT,SWTCH",
    "creditCard": {
      "selectedPaymentMethod": "VISA",
      "paymentDetailsText": "Payment Details",
      "orderTotalText": "Order Total",
      "grandTotalAmount": 45.53,
      "type": "",
      "cardText": " card - ",
      "cardNumberStar": "XXXX XXXX XXXX 1111",
      "paymentAmount": 45.53,
      "CARD_BRAND_TEXT": "Visa"
    }
  },
  "ShowMyOrderForm": {
    "formMethod": "post",
    "orderId": 9658957,
    "orderData": [
      {
        "orderItems": [
          {
            "checkoutProfileFound": "true",
            "profileShipModeId": "26504",
            "profileShipAddressId": "4786570"
          }
        ]
      }
    ],
    "catalogId": "33057",
    "Products": [
      {
        "addressId": 4786570,
        "catEntryId": "31787310",
        "iscmCategory": "GIRL",
        "shippingCountry": "United Kingdom",
        "lineNumber": "02G26NMDT",
        "selectedDeliveryMethod": "UK Standard up to 5 days",
        "name": "MOTO Mid Blue Step Hem Straight Jeans",
        "isDDPProduct": false,
        "skuId": "31786881",
        "productColor": "MID STONE",
        "productSize": "W2630",
        "attributes": {
          "ecmcCreatedTimestamp": "2018-04-26-18.06.58.000578",
          "b_has360": "N",
          "b_hasImage": "N",
          "b_hasVideo": "N",
          "hasVideo": "N",
          "IFSeason": "SS18",
          "StyleCode": "0",
          "thumbnailImageSuffixes": "_",
          "countryExclusion": "",
          "CE3ThumbnailSuffixes": "F_1.jpg|M_1.jpg|M_2.jpg|M_3.jpg",
          "CE3BThumbnailSuffixes": "",
          "IOThumbnailSuffixes": "F_1.jpg|M_1.jpg|M_2.jpg|M_3.jpg",
          "IOBThumbnailSuffixes": "",
          "ThresholdMessage": "",
          "SizeFit": "",
          "ProductDefaultCopy": "",
          "b_thumbnailImageSuffixes": "",
          "Department": "2",
          "has360": "N",
          "NotifyMe": "N",
          "ecmcUpdatedTimestamp": "2018-05-25-13.31.09.000167",
          "EmailBackInStock": "N",
          "STORE_DELIVERY": "true",
          "STYLE_CODE": "NO_SWATCH_5398646",
          "COLOUR_CODE": "525f7a",
          "REAL_COLOURS": "4e5c73|f0f1f2|90a2b9",
          "ECMC_PROD_SIZE_GUIDE_1": "Jeans",
          "ECMC_PROD_CE3_BRANDS_1": "Topshop",
          "ECMC_PROD_PRODUCT_TYPE_1": "Clothing",
          "ECMC_PROD_COLOUR_1": "BLUE",
          "shopTheOutfitBundleCode": "",
          "SearchKeywords": "",
          "RRP": "0.0",
          "ECMC_PROD_FIT_1": "Regular",
          "ECMC_PROD_CE3_PRODUCT_TYPE_1": "Jeans",
          "ECMC_PROD_CE3_JEAN_STYLE_1": "Straight Leg Jeans",
          "ECMC_PROD_CE3_JEAN_FIT_1": "Straight",
          "ECMC_PROD_CE3_JEAN_WAIST_TYPE_1": "Mid Rise"
        },
        "catCode": "02G26NMDT",
        "productId": 31787310,
        "baseImageUrl": "https://images.topshop.com/i/TopShop/TS02G26NMDT_M_1",
        "productImgURL": "https://images.topshop.com/i/TopShop/TS02G26NMDT_M_1.jpg?$Small$",
        "sourceUrl": "http://ts-tst1.tst.digital.arcadiagroup.co.uk/webapp/wcs/stores/servlet/ProductDisplay?langId=-1&storeId=12556&catalogId=33057&productId=31787310&categoryId=&parent_category_rn=",
        "sourceURLTitle": "MOTO Mid Blue Step Hem Straight Jeans",
        "productNameURL": "http://ts-tst1.tst.digital.arcadiagroup.co.uk/webapp/wcs/stores/servlet/ProductDisplay?langId=-1&amp;storeId=12556&amp;catalogId=33057&amp;productId=31787310&amp;categoryId=&amp;parent_category_rn=",
        "lowStockThreshold": "3",
        "selectedQuantity": 1,
        "sizeText": "Size",
        "size": "W2630",
        "quantityText": "Quantity",
        "quantity": "1",
        "unitPrice": 42,
        "totalPrice": 42
      }
    ]
  },
  "orderId": 9658957,
  "sourcePage": "OrderConfirmation",
  "addAddress": "",
  "isBasketDisplay": true,
  "showDeliveryAddress": "true",
  "showDeliveryDate": "true",
  "storeSelected": "N",
  "deliveryEstimateWhere": "Where:",
  "estimatedDeliveryWhenText": "When:",
  "estimatedDelivery": "No later than&nbsp;Tuesday 20 August 2019",
  "nominatedDeliveryDate": "Tuesday 20 August 2019",
  "selectedCountry": "United Kingdom",
  "countrySetInAddress": true,
  "totalBeforeDiscount": 42,
  "OrderDiscounts": {
    "Discount": [
      {
        "value": -0.42,
        "label": "Monty Test 1% off"
      }
    ]
  },
  "deliverySectionLabel": "DeliveryCostSection",
  "deliveryOptionId": 26504,
  "label": " UK Standard up to 5 days",
  "deliveryOptionPrice": 3.95,
  "deliveryCostDetailTxt": "",
  "noOfGiftCards": 0,
  "giftCardApplyStatus": "true",
  "total": 45.53,
  "espots": {
    "espot1": {},
    "espot2EmailSignup": {},
    "espot3SocialNetworking": {},
    "espot4Peerius": {},
    "espot5": {},
    "espot6": {},
    "espot7": {},
    "espot8PaymentMethod": {}
  },
  "URLs": {
    "bctCurrentPage": "OrderConfirm",
    "trackOrderStatusURL": "http://ts-tst1.tst.digital.arcadiagroup.co.uk/webapp/wcs/stores/servlet/TrackOrderStatus?storeId=12556&catalogId=33057&langId=-1",
    "topCategoriesDisplayURL": "http://ts-tst1.tst.digital.arcadiagroup.co.uk/webapp/wcs/stores/servlet/TopCategoriesDisplay?langId=-1&storeId=12556&catalogId=33057",
    "BVWriteReviewURL": "http://ts-tst1.tst.digital.arcadiagroup.co.uk/webapp/wcs/stores/servlet/BVWriteReview?catalogId=33057&storeId=12556&langId=-1",
    "printMessageHyperLinkText": "Print this page",
    "trackMyOrderHyperlinkText": "Track my order",
    "trackMyOrderURL": "http://ts-tst1.tst.digital.arcadiagroup.co.uk/webapp/wcs/stores/servlet/TrackOrderStatus?storeId=12556&amp;catalogId=33057&amp;langId=-1",
    "recentlyViewedMsg": "Recently Viewed",
    "continueShoppingButtonTitle": "Continue shopping",
    "continueShoppingButtonURL": "http://ts-tst1.tst.digital.arcadiagroup.co.uk/webapp/wcs/stores/servlet/TopCategoriesDisplay?langId=-1&amp;storeId=12556&amp;catalogId=33057",
    "myOrderTitle": "My Order"
  },
  "promoCodes": [
    {
      "voucherCodes": "F84MB92NV9",
      "promotionDescription": "Monty Test 1% off"
    }
  ],
  "qubitConfirmationURL": "%0Awindow.universal_variable+%3D+%7B%0A%09%22version%22%3A+%221.2.0%22%2C%0A%09%22page%22%3A+%7B%0A%09%09%22type%22%3A+%22Confirmation%22%0A%09%7D%2C%0A%09%22user%22%3A+%7B%09%09%09%09%0A%09%09%22user_id%22%3A+%225173099%22+%2C%0A%09%09%22email%22%3A+%22foo%40wasf0audgaset.com%22%0A%09%09%09%09%09%0A%09%7D%2C%0A%09%22transaction%22%3A+%7B%0A%09%09%22order_id%22%3A+%229658957%22%2C%0A%09%09%22currency%22%3A+%22GBP%22%2C%0A%09%09%22payment_type%22%3A+%22VISA%22%2C%0A%09%09%22voucher%22%3A+%22F84MB92NV9%22%2C%0A%09%09%22voucher_discount%22%3A+0.42000%2C%0A%09%09%22tax%22%3A+0.00%2C%0A%09%09%22shipping_cost%22%3A+3.95000+%2C%0A%09%09%22shipping_method%22%3A+%22UK+Standard+up+to+5+days%22+%2C%0A%09%09%22subtotal%22%3A+42.00000%2C%0A%09%09%22total%22%3A+45.53000%2C%0A%09%09%22returning_buyer%22%3A+false%2C%0A%09%09%22delivery%22%3A+%7B%0A%09%09%0A%09%09%09%22city%22%3A+%22LONDON%22%2C%0A%09%09%0A%09%09%09%22postcode%22%3A+%22WC1X+9PR%22%2C%0A%09%09%0A%09%09%09%22country%22%3A+%22United+Kingdom%22%0A%09%09%0A%09%09%7D%2C%0A%09%09%22billing%22%3A+%7B%0A%09%09%0A%09%09%09%22Firstname%22%3A+%22Test1%22%2C%0A%09%09+%0A%09%09%09%22Surname%22%3A+%22Test111%22%2C%0A%09%09%0A%09%09%09%22city%22%3A+%22LONDON%22%2C%0A%09%09%0A%09%09%09%22postcode%22%3A+%22WC1X+9PR%22%2C%0A%09%09%0A%09%09%09%22country%22%3A+%22United+Kingdom%22%0A%09%09%0A%09%09%7D%2C%0A%09%09%22line_items%22%3A+%5B%0A%09%09%09%0A%09%09%09%09%7B%0A%09%09%09%09%0A%09%09%09%09%0A%09%09%09%09%22product%22%3A+%7B%0A%09%09%09%09%09%22id%22%3A+%2202G26NMDT%22%2C%0A%09%09%09%09%09%22name%22%3A+%22MOTO+Mid+Blue+Step+Hem+Straight+Jeans%22%2C%0A%09%09%09%09%09%22sku_code%22%3A+%22602018001227638%22%2C%0A%09%09%09%09%09%22image_url%22%3A+%22https%3A%2F%2Fimages.topshop.com%2Fi%2FTopShop%2FTS02G26NMDT_M_1.jpg%3F%24Small%24%22%2C%0A%09%09%09%09%09%22category%22%3A+%22Clothing%22%2C%0A%09%09%09%09%09%22currency%22%3A+%22GBP%22%2C+%0A%09%09%09%09%09%22unit_sale_price%22%3A+42.00000+%2C%0A%09%09%09%09%09%22unit_price%22%3A+42.00%0A%09%09%09%09%7D%2C%0A%09%09%09%09%22quantity%22%3A1%2C%0A%09%09%09%09%22subtotal%22%3A42.00000%2C%0A%09%09%09%09%22lineNumber%22%3A+%2202G26NMDT%22%0A%09%09%09%7D%0A%09%09%09%0A%09%09%5D%0A%09%7D%0A%7D%0A",
  "tradeDoublerEnabled": "N",
  "cheetahEnabled": "Y",
  "CheetahTrack": {
    "cheetahDomain": "https://p.chtah.com",
    "cheetahGIF": "TopShop.gif",
    "cheetahAffiliateAcct": "r1941655062/TopShop.gif",
    "cheetahEBMAffiliateAcct": "r2075667233/TopShop.gif",
    "cheetahURL": "https://p.chtah.com/a/r1941655062/TopShop.gif?id=9658957&amount=42.00&items=02G26NMDT%401%4042.00&discount=-0.42&promocds=F84MB92NV9",
    "cheetahEBMURL": "https://p.chtah.com/a/r2075667233/TopShop.gif?id=9658957&amount=42.00&items=02G26NMDT%401%4042.00&discount=-0.42&promocds=F84MB92NV9"
  },
  "storeId": "12556",
  "userId": "5173099",
  "loggersEnabled": "false"
}
